## Pandas 332 List

In [2]:
import pandas as pd
import numpy as np

## 176. Second Highest Salary [M]

Write a solution to find the second highest distinct salary from the Employee table. If there is no second highest salary, return null (return None in Pandas).

In [5]:
data = [[1, 100], [2, 200], [3, 300]]
data = [[1, 100], [2, 200]]

employee = pd.DataFrame(data, columns=['id', 'salary']).astype({'id':'int64', 'salary':'int64'})

employee

   id  salary
0   1     100
1   2     200

In [ ]:
def second_highest_salary(employee: pd.DataFrame) -> pd.DataFrame:
    top2 = employee['salary'].drop_duplicates().nlargest(2).sort_values(ascending=False).reset_index(drop=True)
    val = top2[1] if len(top2) >= 2 else None
    return pd.DataFrame({'SecondHighestSalary': [val]})

In [24]:
top2 = employee['salary'].drop_duplicates().nlargest(2).sort_values(ascending=False).reset_index(drop=True)
val = top2[1] if len(top2) >= 2 else None
val

np.int64(100)

In [8]:
second_highest_salary(employee)

   SecondHighestSalary
0                  200